from typing import List, Tuple

# Основные параметры системы (точка бифуркации)
SYSTEM_PARAMS: List[Tuple[str, float]] = [
    ("с", 16.67),
    ("μ", 1.2),
    ("С₀", 1.128),
    ("V", 0.33),
    ("ɛ", 3.3),
    ("d", 0.023),
    ("e", 1.67),
    ("f", 9.0),
    ("η", 16.67),
    ("Da", 0.0620036278),
    ("Ds", 1.0),
    ("Dy", 1.0)
]

# Равновесие
EQUILIBRIUM_PARAMS = [
    ("a", 0.512934),
    ("s", 0.140341),
    ("y", 1.006568)
]

# Пространственные параметры
SPATIAL_PARAMS = [
    ("k", 1.0),
    ("L", 1.0)
]

# параметры начального приближения в методе Ньютона
INITIAL_PARAMS = [
    ("a", 0.5),
    ("s", 0.5),
    ("y", 0.5)
]
