from typing import Dict
import numpy as np

PRESETS: Dict[str, Dict] = {
    "Набор 1 (стационарное однородное)": {
        "a_0": np.array([1.0, 0.5, 0.2]),
        "a_1": np.array([0.0, 0.0, 0.0]),
        "a_2": np.array([0.0, 0.0, 0.0]),
        "a_3": np.array([0.01, 0.05, 0.02]),
        "b_1": 0, "b_2": 0, "b_3": 3,
        "n": 10, "m": 500, "T": 10.0,
        "system_params": {
            "c": 16.67, "μ": 1.2, "c₀": 1.128, "ν": 0.33,
            "ε": 3.3, "d": 0.023, "e": 1.67, "f": 9.0,
            "η": 16.67, "Dₐ": 0.1, "Dₛ": 0.1, "Dᵧ": 0.1
        }
    },
    "Набор 2 (стационарное неоднородное)": {
        "a_0": np.array([1.0, 0.5, 0.2]),
        "a_1": np.array([0.1, 0.5, 1.0]),
        "a_2": np.array([0.0, 0.0, 0.0]),
        "a_3": np.array([0.0, 0.0, 0.0]),
        "b_1": 1, "b_2": 0, "b_3": 0,
        "n": 10, "m": 150000, "T": 600.0,
        "system_params": {
            "c": 16.67, "μ": 1.2, "c₀": 1.128, "ν": 0.33,
            "ε": 3.3, "d": 0.023, "e": 1.67, "f": 9.0,
            "η": 16.67, "Dₐ": 0.05, "Dₛ": 1.0, "Dᵧ": 1.0
        }
    }
}
